In [1]:
import pandas as pd
from pandasql import sqldf
import numpy as np

In [2]:
men = pd.DataFrame({'id_man': [0, 1, 2, 3], 
                    'name': ['Вася', 'Петя', 'Миша', 'Вася'], 
                    'age': [30, 50, 40, 50]})
women = pd.DataFrame({'id_woman': [0, 1, 2, 3], 
                        'name': ['Маша', 'Аня', 'Аня', 'Лена'], 
                        'age': [25, 51, 38, 38]})
children = pd.DataFrame({'id_child': [0, 1, 2, 3, 4, 5], 
                        'name': ['Миша', 'Аня', 'Лиза', 'Лена', 'Боря', 'Рома'], 
                        'gender': ['b', 'g', 'g', 'g', 'b', 'b'],
                        'age': [5, 11, 14, 8, 12, 11],
                        'id_man': [0, 1, 1, 2, 2, 2],
                        'id_woman': [0, 1, 1, 2, 2, 2]})

Код из занятия Карпова

In [141]:
# В таблице user_actions сохраняются действия покупателей в интернет магазине, структура таблицы

# user_id    - id пользователя
# product_id - id товара
# action     - действие, просмотр товара, сохранение в корзину, покупка
# time       - время совершения события
# date       - дата события

# Для каждого дня рассчитайте, какой процент просмотров товаров завершился покупкой

In [2]:
all_user_ids = np.arange(1, 1001)
all_product_ids = np.arange(1, 101)

In [3]:
n = 10000

In [4]:
user_ids    = np.random.choice(all_user_ids, n)
product_ids = np.random.choice(all_product_ids, n)

In [5]:
start_date = pd.to_datetime('2022-01-01')

In [6]:
times = pd.date_range(start_date, periods=n, freq='1min')

In [7]:
user_actions = pd.DataFrame({'user_id': user_ids, 
                             'product_id': product_ids, 
                             'time': times})

In [8]:
user_actions['action'] = 'view'

In [9]:
user_actions.head()

   user_id  product_id                time action
0      191          18 2022-01-01 00:00:00   view
1      960          44 2022-01-01 00:01:00   view
2      401          70 2022-01-01 00:02:00   view
3      418          36 2022-01-01 00:03:00   view
4      769          92 2022-01-01 00:04:00   view

In [10]:
def generate_funel_actions(user_id, product_id, time):
    to_cart = 0.2
    to_purchase = 0.4
    
    df = pd.DataFrame()
    
    if np.random.binomial(1, to_cart, 1)[0]:
        df = pd.DataFrame({
                           'user_id'   : user_id, 
                           'product_id': product_id, 
                           'time'      : time + pd.Timedelta(5, unit='s'), 
                           'action'    : 'add to cart'}, index=[0])
        
        if np.random.binomial(1, to_purchase, 1)[0]:
            df_purchase = pd.DataFrame({
                           'user_id'   : user_id, 
                           'product_id': product_id, 
                           'time'      : time + pd.Timedelta(10, unit='s'), 
                           'action'    : 'purchase'}, index=[0])
    
            df = df.append(df_purchase)
    return df

In [11]:
to_cart_df = pd.DataFrame()

In [12]:
for index, row in user_actions.iterrows():
    user_df = generate_funel_actions(row['user_id'], row['product_id'], row['time'])
    to_cart_df = to_cart_df.append(user_df)

In [13]:
user_actions = user_actions.append(to_cart_df)
user_actions = user_actions.sort_values('time')

In [14]:
user_actions['date'] = user_actions.time.dt.date

In [15]:
user_actions.head()

   user_id  product_id                time       action        date
0      191          18 2022-01-01 00:00:00         view  2022-01-01
1      960          44 2022-01-01 00:01:00         view  2022-01-01
0      960          44 2022-01-01 00:01:05  add to cart  2022-01-01
2      401          70 2022-01-01 00:02:00         view  2022-01-01
3      418          36 2022-01-01 00:03:00         view  2022-01-01

In [16]:
q = """SELECT date, 
              views, 
              carts, 
              purchases, 
              100 * purchases / views as purchase_percantage 
       FROM (
           SELECT date, 
            count(case when action = 'view'        then 1 else NULL end) as views, 
            count(case when action = 'add to cart' then 1 else NULL end) as carts, 
            count(case when action = 'purchase'    then 1 else NULL end) as purchases 
           FROM user_actions 
           GROUP BY date);"""

In [17]:
sqldf(q)

         date  views  carts  purchases  purchase_percantage
0  2022-01-01   1440    258        107                    7
1  2022-01-02   1440    315        121                    8
2  2022-01-03   1440    279        119                    8
3  2022-01-04   1440    299        127                    8
4  2022-01-05   1440    228         86                    5
5  2022-01-06   1440    288        106                    7
6  2022-01-07   1360    283        110                    8

Все ограничения SQLite, например: 
- не реализуется правое и полное внешнее соединения;
- не знает ALL и ANY.

Выполняет только запросы и не может: обновление, вставку и изменение таблиц.

In [2]:
men = pd.DataFrame({'id_man': [0, 1, 2, 3], 
                    'name': ['Вася', 'Петя', 'Миша', 'Вася'], 
                    'age': [30, 50, 40, 50]})
women = pd.DataFrame({'id_woman': [0, 1, 2, 3], 
                        'name': ['Маша', 'Аня', 'Аня', 'Лена'], 
                        'age': [25, 51, 38, 38]})
children = pd.DataFrame({'id_child': [0, 1, 2, 3, 4, 5], 
                        'name': ['Дима', 'Аня', 'Лиза', 'Лена', 'Боря', 'Рома'], 
                        'gender': ['b', 'g', 'g', 'g', 'b', 'b'],
                        'age': [5, 11, 14, 8, 12, 11],
                        'id_man': [0, 1, 1, 2, 2, 2],
                        'id_woman': [0, 1, 1, 2, 2, 2]})

In [5]:
q = """SELECT c.name, c.age, m.name father, m.age f_age, w.name mother, w.age m_age 
       FROM children c 
       JOIN men m ON c.id_man = m.id_man
       JOIN women w ON c.id_woman = w.id_woman;"""
sqldf(q)

   name  age father  f_age mother  m_age
0  Дима    5   Вася     30   Маша     25
1   Аня   11   Петя     50    Аня     51
2  Лиза   14   Петя     50    Аня     51
3  Лена    8   Миша     40    Аня     38
4  Боря   12   Миша     40    Аня     38
5  Рома   11   Миша     40    Аня     38

In [6]:
"""Имена девочек, которые не встречаются среди женщин"""
q = """SELECT DISTINCT name 
       FROM children
       WHERE gender = 'g'
       EXCEPT
       SELECT DISTINCT name 
       FROM women;"""
sqldf(q)

   name
0  Лиза

In [7]:
"""Имена девочек, которые не встречаются среди женщин"""
q = """SELECT DISTINCT name 
       FROM children
       WHERE gender = 'g'
       AND name NOT IN (SELECT DISTINCT name FROM women);"""
sqldf(q)

   name
0  Лиза

In [9]:
q = "SELECT DISTINCT name FROM children WHERE gender = 'g'"
sqldf(q)

   name
0  Маша
1   Аня
2  Лена

In [11]:
'Имена детей, у которых отцы старше 40'
q = """SELECT c.name 
       FROM children c 
       JOIN men m ON c.id_man = m.id_man
       WHERE m.age > 40;"""
sqldf(q)

   name
0   Аня
1  Лиза

In [14]:
'Имена детей, у которых отцы старше 40'
q = """SELECT c.name 
       FROM children c
       WHERE id_man IN (SELECT id_man
                        FROM men m
                        WHERE m.age > 40);"""
sqldf(q)

   name
0   Аня
1  Лиза

In [16]:
'имя самого старшего из мужчин'
q = '''SELECT name
        FROM men
        WHERE age = (SELECT MAX(age) FROM men);'''
sqldf(q)

   name
0  Петя
1  Вася

In [11]:
'вывести имена мужчин, чей возраст отличается от среднего более, чем на 10 лет'
q = '''SELECT name
        FROM men
        WHERE ABS(age - (SELECT AVG(age) FROM men)) > 10;'''
sqldf(q)

   name
0  Вася

In [ ]:
'вывести имена детей, чей возраст меньше самого большого из средних возрастов и мальчиков, и девочек'
q = '''SELECT name, age
       FROM children
       WHERE age < ANY(SELECT AVG(age) 
                       FROM children
                       GROUP BY gender);'''
'в sqlite нет ANY и ALL'

In [20]:
'вывести имена детей и на сколько их возраст отличается от среднего'
q = '''SELECT name, age - (SELECT AVG(age) FROM children)
        FROM children;'''
sqldf(q)

   name  age - (SELECT AVG(age) FROM children)
0  Дима                              -5.166667
1   Аня                               0.833333
2  Лиза                               3.833333
3  Лена                              -2.166667
4  Боря                               1.833333
5  Рома                               0.833333

In [9]:
'вывести имена самых младших детей обоих полов'
q = '''SELECT name, age
       FROM children
       WHERE (gender, age) IN (SELECT gender, MIN(age)
                               FROM children
                               GROUP BY gender);'''
sqldf(q)

   name  age
0  Миша    5
1  Лена    8

In [5]:
'вывести имя старшего ребенка'
q = '''SELECT name, age
       FROM children
       WHERE age = (SELECT MAX(age) FROM children);'''
sqldf(q)

   name  age
0  Лиза   14

In [10]:
'на сколько каждая девочка старше самого младшего ребенка'
q = '''SELECT name, age - (SELECT MIN(age) FROM children) 'разница'
       FROM children
       WHERE gender = 'g';'''
sqldf(q)

   name  разница
0   Аня        6
1  Лиза        9
2  Лена        3

In [5]:
'имена родителей Миши'
q = '''SELECT m.name, w.name
       FROM children c
       JOIN men m ON m.id_man = c.id_man
       JOIN women w ON w.id_woman = c.id_woman
       WHERE c.name = 'Миша';'''
sqldf(q)

   name  name
0  Вася  Маша

In [11]:
'имена девочек, имеющих, по крайней мере, одну сестру (каждый отец в одной семье детей имеет)'
q = '''SELECT name
       FROM children
       WHERE gender = 'g'
       AND id_man IN (SELECT id_man
                       FROM children
                       WHERE gender = 'g'
                       GROUP BY id_man
                       HAVING COUNT(*) > 1);'''
sqldf(q)

   name
0   Аня
1  Лиза
2  Лена

In [20]:
'id мужчин имеющих по крайней мере одну дочь'
q = '''SELECT id_man
       FROM children
       WHERE gender = 'g'
       GROUP BY id_man
       HAVING COUNT(*) >= 1;'''
sqldf(q)

   id_man
0       1
1       2

In [3]:
children

   id_child  name gender  age  id_man  id_woman
0         0  Миша      b    5       0         0
1         1   Аня      g   11       1         1
2         2  Лиза      g   14       1         1
3         3  Лена      g    8       2         2
4         4  Боря      b   12       2         2
5         5  Рома      b   11       2         2

In [7]:
'имена детей, у которых мама - Аня, а папа - Петя'
q = '''SELECT c.name
       FROM children c JOIN men m ON c.id_man = m.id_man
       WHERE m.name = 'Петя'
       
       INTERSECT
       
       SELECT c.name
       FROM children c JOIN women w ON c.id_woman = w.id_woman
       WHERE w.name = 'Аня';'''
sqldf(q)

   name
0   Аня
1  Лиза

In [8]:
q = '''SELECT c.name
       FROM children c 
       JOIN men m ON c.id_man = m.id_man
       JOIN women w ON c.id_woman = w.id_woman
       WHERE m.name = 'Петя' and w.name = 'Аня';'''
sqldf(q)

   name
0   Аня
1  Лиза

In [9]:
q = '''SELECT c.name
       FROM children c JOIN men m ON c.id_man = m.id_man
       WHERE m.name = 'Петя'
       AND c.name IN(SELECT c.name
                     FROM children c JOIN women w ON c.id_woman = w.id_woman
                     WHERE w.name = 'Аня');'''
sqldf(q)

   name
0   Аня
1  Лиза